---
title: Options
classe: Autodesk.Revit.DB.Options
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.APIObject
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# Options

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean ComputeReferences { get; set; }` | `options.ComputeReferences` | Boolean |
| `ViewDetailLevel DetailLevel { get; set; }` | `options.DetailLevel` | ViewDetailLevel |
| `Boolean IncludeNonVisibleObjects { get; set; }` | `options.IncludeNonVisibleObjects` | Boolean |
| `View View { get; set; }` | `options.View` | View |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```